{"config": {"layers": [{"config": {"batch_input_shape": [null, 784], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense", "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "units": 256, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense"}, {"config": {"rate": 0.050000000000000044, "dtype": "float32", "name": "dropout", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "units": 256, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"rate": 0.050000000000000044, "dtype": "float32", "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_2", "activation": "softmax", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "units": 10, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2"}], "name": "model", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.6-tf", "backend": "tensorflow"}